<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"75d39a0449f323b2a3edda2bee127f4619c2bb44da2faaf2d48c7224916c4b26","plan_job_ref":"Job Staging Image Build & Push #53 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439750848","plan_hash":"e584aada5c60a7e8c6953811b8e6aacf108b8132101b0b0b0a18f979a22b264f","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
        name                             = "fastapi-ASG-dev"
#        (26 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:40" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition will be created
+   resource "aws_ecs_task_definition" "task_definition" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu          = 256
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:4e0f2a6ab4a4365ca575935023fc17b79569e349"
+                   memory       = 512
+                   name         = "dev_FastAPI_image"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       family                   = "dev-fastapi-container"
+       id                       = (known after apply)
+       network_mode             = (known after apply)
+       requires_compatibilities = [
+           "EC2",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "Environment" = "Dev Environment"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #53](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439750848)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>